app/controllers/users/omniauth_callbacks_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "provider", "uid", "refresh_token", "access_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def google_oauth2
    @user = User.create_from_provider_data(request.env['omniauth.auth'])